BS_XAS_XAS_UGISAPP__MASTER_100157/BS_XAS_XAS_UGISAPP__MASTER_100157/XA-XAS-TEST/src/test/resources/webservice/SendSms/tc_1.0_wse_2004_compatibility_request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:wsut="http://wsutil.xas.xframe.usi.it" xmlns:data="http://data.bfutil.xas.xframe.usi.it">
  <soapenv:Header>
  <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
  <wsse:UsernameToken>
    		<wsse:Username>{username}</wsse:Username>
    		<wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">{password}</wsse:Password>
  		</wsse:UsernameToken>
	 </wsse:Security>
	<slf:smartLogFacility xmlns:slf="urn:smart-log-facility"  
		soapenv:role="http://www.w3.org/2003/05/soap-envelope/role/next"
		soapenv:relay="true">
   		<slf:uuid>{slf_uuid}</slf:uuid>
   		<slf:crid>{slf_crid}</slf:crid>
  	</slf:smartLogFacility>
  </soapenv:Header>
  <soapenv:Body>
     <wsut:sendSms>
        <wsut:sms>
           <data:msg>{testName} - {xasUserTest}</data:msg>
           <data:phoneNumber>{phone}</data:phoneNumber>
        </wsut:sms>
        <wsut:sender>
           <data:alias/>
           <data:ABICode>02008XAS</data:ABICode>
        </wsut:sender>
     </wsut:sendSms>
  </soapenv:Body>
</soapenv:Envelope>